In [4]:
import pandas as pd
import numpy as np

data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(data,index=labels)

1.Select the rows where the animal is a cat and the age is less than3.

In [5]:
df[(df['animal'] == 'cat') & (df['age'] < 3)]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

2.Select the rows the age is between 2 and 4 (inclusive).

In [7]:
df[df['age'].between(2,4)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no

3.change the age in row 'f' to 1.5

In [9]:
df.loc['f', 'age']=1.5

4.calculate the sum of visits

In [11]:
df['visits'].sum()

19

5.calculate the mean age for each different animal in df

In [12]:
df.groupby('animal')['age'].mean()

animal
cat      2.333333
dog      5.000000
snake    2.500000
Name: age, dtype: float64

6. Append a new row 'k' to df with your choice of values for each column. Then delete that row to return the original DataFrame.

In [13]:
df

  animal  age  visits priority  (f, age)
a    cat  2.5       1      yes       1.5
b    cat  3.0       3      yes       1.5
c  snake  0.5       2       no       1.5
d    dog  NaN       3      yes       1.5
e    dog  5.0       2       no       1.5
f    cat  1.5       3       no       1.5
g  snake  4.5       1       no       1.5
h    cat  NaN       1      yes       1.5
i    dog  7.0       2       no       1.5
j    dog  3.0       1       no       1.5

In [33]:
df.loc['k'] = ['bird',2.4,3,'yes',1.5]
df=df.drop('k')
df

  animal  age  visits priority  (f, age)
a    cat  2.5       1      yes       1.5
b    cat  3.0       3      yes       1.5
c  snake  0.5       2       no       1.5
d    dog  NaN       3      yes       1.5
e    dog  5.0       2       no       1.5
f    cat  1.5       3       no       1.5
g  snake  4.5       1       no       1.5
h    cat  NaN       1      yes       1.5
i    dog  7.0       2       no       1.5
j    dog  3.0       1       no       1.5

7.count the number of each type of animal

In [28]:
df.animal.value_counts()

cat      4
dog      4
snake    2
bird     1
Name: animal, dtype: int64

8. Sort df first by the values in the 'age' in decending order, then by the value in the 'visit' column in ascending order.

In [35]:
df.sort_values(by=['age','visits'],ascending=[False,True])

  animal  age  visits priority  (f, age)
i    dog  7.0       2       no       1.5
e    dog  5.0       2       no       1.5
g  snake  4.5       1       no       1.5
j    dog  3.0       1       no       1.5
b    cat  3.0       3      yes       1.5
a    cat  2.5       1      yes       1.5
f    cat  1.5       3       no       1.5
c  snake  0.5       2       no       1.5
h    cat  NaN       1      yes       1.5
d    dog  NaN       3      yes       1.5

9. The 'priority' column contains the values 'yes' and 'no'. Replace this column with a column of boolean values: 'yes' should be True and 'no' should be False.

In [39]:
df2 = df['priority'].map({'yes': True, 'no': False})
df2

a    NaN
b    NaN
c    NaN
d    NaN
e    NaN
f    NaN
g    NaN
h    NaN
i    NaN
j    NaN
Name: priority, dtype: object

10. In the 'animal' column, change the 'snake' entries to 'python'.

In [44]:
df3=df['animal'].replace('snake','python')
df3

a       cat
b       cat
c    python
d       dog
e       dog
f       cat
g    python
h       cat
i       dog
j       dog
Name: animal, dtype: object